## Terraform Plan Output
<details><summary>Click to expand</summary>

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # azurerm_container_app.z0rbot-ca will be created
  + resource "azurerm_container_app" "z0rbot-ca" {
      + container_app_environment_id  = (known after apply)
      + custom_domain_verification_id = (sensitive value)
      + id                            = (known after apply)
      + latest_revision_fqdn          = (known after apply)
      + latest_revision_name          = (known after apply)
      + location                      = (known after apply)
      + name                          = "ca-z0rbot-westeurope-001"
      + outbound_ip_addresses         = (known after apply)
      + resource_group_name           = "rg-z0rbot-westeurope-001"
      + revision_mode                 = "Single"

      + identity {
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = "SystemAssigned"
        }

      + registry {
          + password_secret_name = "ghcr-password"
          + server               = "ghcr.io"
          + username             = "vidakk"
        }

      + secret {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }

      + template {
          + max_replicas    = 10
          + min_replicas    = 0
          + revision_suffix = (known after apply)

          + container {
              + cpu               = 0.25
              + ephemeral_storage = (known after apply)
              + image             = "ghcr.io/vidakk/z0rbot/z0rbot:latest"
              + memory            = "0.5Gi"
              + name              = "z0rbot"

              + env {
                  + name  = "DISCORD_TOKEN"
                  + value = "var.discord_token"
                }
            }
        }
    }

  # azurerm_container_app_environment.z0rbot-cae will be created
  + resource "azurerm_container_app_environment" "z0rbot-cae" {
      + custom_domain_verification_id    = (known after apply)
      + default_domain                   = (known after apply)
      + docker_bridge_cidr               = (known after apply)
      + id                               = (known after apply)
      + internal_load_balancer_enabled   = false
      + location                         = "westeurope"
      + mutual_tls_enabled               = false
      + name                             = "cae-z0rbot-westeurope-001"
      + platform_reserved_cidr           = (known after apply)
      + platform_reserved_dns_ip_address = (known after apply)
      + resource_group_name              = "rg-z0rbot-westeurope-001"
      + static_ip_address                = (known after apply)
      + zone_redundancy_enabled          = false
    }

  # azurerm_resource_group.z0rbot-rg will be created
  + resource "azurerm_resource_group" "z0rbot-rg" {
      + id       = (known after apply)
      + location = "westeurope"
      + name     = "rg-z0rbot-westeurope-001"
    }

Plan: 3 to add, 0 to change, 0 to destroy.
```
</details>